<?php

return array(
    //
    // GENERAL
    //
     'WysiwygMDEditor_PLUGIN_DESCRIPTION' => 'Интегрира външни MD редактори в Kanboard с цел удобно редактиране/преглед
                                             (и евентуално изобразяване) на markdown текстовите полета в интерфейса на Kanboard.
                                             Всеки редактор позволява различни персонализации на функционалност, MD функции и UI теми.',
    //
    // Template/config/settings
    //
     'WysiwygMDEditor_TITLE_SETTINGS' => 'Настройки на Wysiwyg MD Editor',
     'WysiwygMDEditor_TITLE_PREVIEW' => 'Преглед на Wysiwyg MD Editor',
     'WysiwygMDEditor_LINK_SETTINGS_PREVIEW' => 'Преглед със запазените настройки',
     'WysiwygMDEditor_LINK_SETTINGS_CHANGE' => 'Промяна на настройките',
     'WysiwygMDEditor_CONTAINER_PREVIEW' => 'Поле за преглед',
     'WysiwygMDEditor_SETTINGS_EDITING_OPTIONS' => 'Настройка на опциите за редактиране',
     'WysiwygMDEditor_SETTINGS_EDITING_DESCR' => 'Изберете кои MD редактори да използвате.
                                                 Активирането на редактор ще постави съответен бутон в лентата с инструменти за редактиране на всяко markdwon текстово поле.
                                                 Всички редактори се отварят независимо един от друг покривайки целия екран, така че да са отделени от потребителския интерфейс на Kanboard.
                                                 Единствения потребителски интерфейс на редакторите е на английски, няма налични преводи за тях.',
     'WysiwygMDEditor_SETTINGS_EDITING_ENABLE_BUTTON' => 'Активиране на бутон за',
     'WysiwygMDEditor_SETTINGS_EASYMDE_DESCR' => 'Напълно офлайн markdown редактор на JavaScript.
                                                 Конфигуриран да покрива пълния MD синтаксис и функции за визуализация, съвместими с GFM.
                                                 Поддържа редактиране с паралелен преглед и има персонализирана лента с множество инструменти.
                                                 Доставя се с три теми: светла, затъмнена и тъмна.
                                                 Внедрява подчертаване на синтаксиса на кода чрез HighlightJS за около 40 най-често срещани езика.
                                                 Няма поддръжка за upload на изображения, drag или paste, само чрез URL адреси.
                                                 Няма поддръжка за синтаксис на емотикони, само чрез shortcut-и за емотикони в OS (напр. «WIN +.»).',
     'WysiwygMDEditor_SETTINGS_EASYMDE_THEME_SELECT' => 'Изберете темата по подразбиране за EasyMDE :',
     'WysiwygMDEditor_SETTINGS_EASYMDE_THEME_LIGHT' => 'Светла тема',
     'WysiwygMDEditor_SETTINGS_EASYMDE_THEME_DIMMED' => 'Затъмнена тема',
     'WysiwygMDEditor_SETTINGS_EASYMDE_THEME_DARK' => 'Тъмна тема',
     'WysiwygMDEditor_SETTINGS_STACKEDIT_DESCR' => 'Онлайн базиран markdown редактор и инструмент за водене на бележки.
                                                 Покрива широка гама от вариации на MD синтаксис, но е конфигуриран да отговаря на GFM.
                                                 Поддържа редактиране с паралелен преглед, множество инструменти, богати опции и персонализации.
                                                 Има превключване за базова светла/тъмна тема, има множество цветни теми чрез опции за двата панела - за редактиране и за преглед.
                                                 Избраните предпочитания се запомнят локално от браузъра, при повторно отваряне на редактора последният изглед ще бъде възстановен.
                                                 Поддържа подчертаване на синтаксиса на кода за множество езици.
                                                 Поддръжка за upload, drag и paste на изображения, НО ИМАЙТЕ ПРЕДВИД, че те използват локалното хранилище на браузъра, а не Kanboard DB!
                                                 Напълно поддържа синтаксис за емотикони и въвеждане чрез shortcut-и за емотикони в OS (напр. «WIN + .»).
                                                 Има допълнителни функции като KaTeX математически изрази, Mermaid UML диаграми и други разширения, които се
                                                 поддържат по подразбиране, НО НЕ СА СЪВМЕСТИМИ със стандартния набор от MD функции, който се поддържа от Kanboard!',
     'WysiwygMDEditor_SETTINGS_RENDERING_OPTIONS' => 'Настройка на опциите за изобразяване',
     'WysiwygMDEditor_SETTINGS_RENDERING_DESCR' => '(TODO)',
);
